"""
Создать список элементы которого являются степенями 2
"""

list1 = [2 ** i for i in range(1, 11)]

print(list1)
